AUTO_config_TK_pesok/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование2</name>
    <comment>Локализованное наименование 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>Базовая единица измерения номенклатуры</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <comment>Основная единица измерения номенклатуры</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияУпаковки</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЯщиков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <comment>Тип номенклатуры</comment>
    <type>
      <types>CatalogRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <comment>Вид номенклатуры</comment>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяМарка</name>
    <type>
      <types>CatalogRef.ТоварныеМарки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>Страна происхождения по умолчанию</comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияТовара</name>
    <comment>Срок хранения товара (в днях)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЦенообразования</name>
    <comment>Группа ценообразования</comment>
    <type>
      <types>CatalogRef.ГруппыЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУКТВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>АкцизГруппа</name>
    <comment>Группа акциза</comment>
    <type>
      <types>CatalogRef.ГруппыАкциза</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляБухгалтерии</name>
    <comment>Группа для бухгалтерии</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПланирования</name>
    <type>
      <types>CatalogRef.ТипНоменклатурыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойАртикул</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИндикатива</name>
    <type>
      <types>CatalogRef.ТК_ТипыИндикатива</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеRB</name>
    <comment>Наименование  для Radio Beacon</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.ТК_Производитель</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Товара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНабора</name>
    <comment>Состав набора</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаЦены</name>
      <comment>Способ расчета цены реализации</comment>
      <type>
        <types>EnumRef.СпособыРасчетаЦены</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Catalogs/Номенклатура/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Функция НеобходимаРегистрацияНаВыгрузку()
	
	ИсключаемыеГруппыТоваров = ОбменФронтПовтИсп.МассивНеАтивногоТовара();
	Рез = ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Родитель КАК Родитель,
		|	Номенклатура.Родитель.Родитель КАК РодительРодитель,
		|	Номенклатура.Родитель.Родитель.Родитель КАК РодительРодительРодитель,
		|	Номенклатура.Родитель.Родитель.Родитель.Родитель КАК РодительРодительРодительРодитель,
		|	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель КАК РодительРодительРодительРодительРодитель
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Рез;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	КоличествоКолонок =  РезультатЗапроса.Колонки.Количество() - 1;
	псНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	Для Каждого  мГруппа Из ИсключаемыеГруппыТоваров Цикл 
		Для НомерКолонки = 0 По КоличествоКолонок Цикл 
			ТекущийЭлементГруппы = Выборка[НомерКолонки]; 
			
			Если ТекущийЭлементГруппы = псНоменклатура Тогда
				Прервать;
			ИначеЕсли ТекущийЭлементГруппы = мГруппа Тогда
				Рез = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции
	
	
Процедура УстановитьАктивностьТовара()
	
	Если НЕ ЗначениеЗаполнено(Родитель) Тогда
		НеАктивный = Истина;
		Возврат;
	КонецЕсли;
	
	ТекРодитель = Родитель;
	ИсключаемыеГруппыТоваров = ОбменФронтПовтИсп.МассивНеАтивногоТовара();
	
	АктивностьТовара = Истина;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл 
		МожноПрервать = Ложь;
		Для Каждого  мГруппа Из ИсключаемыеГруппыТоваров Цикл 
			
			Если мГруппа = ТекРодитель Тогда
				АктивностьТовара = Ложь;
				МожноПрервать = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если МожноПрервать Тогда
			Прервать;
		КонецЕсли;
		ТекРодитель = ТекРодитель.Родитель;
		
	КонецЦикла;
	
	НеАктивный = Не АктивностьТовара;
	
	
КонецПроцедуры

Процедура ОбработатьДляОпенСтор()
	
	//Если перемещают из группы неиспользуемые товары зарегестрируем цены для выгрузки OS
	Если НЕ ЭтоНовый() И НеобходимаРегистрацияНаВыгрузку()  Тогда
		ДополнительныеСвойства.Вставить("РегистрацияНеИспользуемыйТовар",Истина);
	КонецЕсли;

	// Установка фл. не активности товара, не активный товар не выгружается в OS
	Если НЕ ЭтоГруппа Тогда
		УстановитьАктивностьТовара();
	КонецЕсли;
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Наименование       = ОбщегоНазначенияТККлиентСервер.УдалитьСпецСимволыСтроки(Наименование);
	Если Не ЭтоГруппа  Тогда
		ОсновнойШтрихКод	= СокрЛП(ОсновнойШтрихКод);
		НаименованиеПолное 	= ОбщегоНазначенияТККлиентСервер.УдалитьСпецСимволыСтроки(НаименованиеПолное);
		НаименованиеRB     	= ОбщегоНазначенияТККлиентСервер.УдалитьСпецСимволыСтроки(НаименованиеRB);
	КонецЕсли;
	
	ПроверитьУникальностьАртикула(Отказ);
	
	Если Не Отказ Тогда 
		ОбработатьДляОпенСтор();
	КонецЕсли;		
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ОсновнойШтрихКод) Тогда
		
		НаборШК = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
		НаборШК.Отбор.Штрихкод.Установить(ОсновнойШтрихКод);
		НаборШК.Прочитать();
		
		Если НаборШК.Количество() = 0 Тогда
			НоваяЗапись = НаборШК.Добавить();
			НоваяЗапись.Номенклатура = Ссылка;
			НоваяЗапись.Штрихкод = ОсновнойШтрихКод;
			НоваяЗапись.Упаковка = ОсновнаяЕдиницаИзмерения;
			НаборШК.Записать();	
		КонецЕсли;		
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЭтоГруппа Тогда 
		ОсновнойШтрихКод = "";
	КонецЕсли;

КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	ОсновнойШтрихКод = "";
	ОсновнойАртикул = "";
	Артикул = "";
	ПустаяЕдиницыИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	ОсновнаяЕдиницаИзмерения = ПустаяЕдиницыИзмерения;
	ЕдиницаИзмеренияУпаковки = ПустаяЕдиницыИзмерения;
	ЕдиницаИзмеренияЯщиков   = ПустаяЕдиницыИзмерения;
	ИД_Товара = 0;
КонецПроцедуры




Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	МассивУдалить = Новый Массив;
	Если ЭтоГруппа Тогда
		МассивУдалить.Добавить("СтавкаНДС");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивУдалить);

	
КонецПроцедуры


Процедура ПроверитьУникальностьАртикула(Отказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Артикул = &Артикул
	               |	И Номенклатура.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда 
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Артикул ""%1"" уже используется в номенклатуре ""%2""'; uk = 'Артикул ""%1"" вже використовується в номенклатурі ""%2""'"),
				Артикул,
				Выборка.Ссылка),
			Выборка.Ссылка);
	КонецЕсли;
	
КонецПроцедуры


#КонецЕсли
